app/controllers/messages_controller.rb

SELECT * FROM `messages` WHERE (`messages`.`id` = 1)
---
  def show
    @message = Message.find(params[:id])

SELECT * FROM `messages` WHERE (`messages`.`id` = 1)
---
  def edit
    @message = Message.find(params[:id])

INSERT INTO `messages` (`updated_at`, `content`, `owner_id`, `created_at`) VALUES('2008-11-25 21:06:10', 'fra thomas', 1, '2008-11-25 21:06:10')
---
  def create
    @message = Message.new(params[:message])
    @message.owner = current_user

    respond_to do |format|
      if @message.save

SELECT * FROM `messages` WHERE (`messages`.`id` = 1)
UPDATE `messages` SET `content` = 'fra thomas ..', `updated_at` = '2008-11-25 21:06:26' WHERE `id` = 1
---
  def update
    @message = Message.find(params[:id])

    unless @message.owner.id == current_user.id
      flash[:notice] = 'Hey stop it!'
      redirect_to messages_path
      return
    end

    respond_to do |format|
      if @message.update_attributes(params[:message])

SELECT * FROM `messages` WHERE (`messages`.`id` = 4)
DELETE FROM `messages`
---
  def destroy
    @message = Message.find(params[:id])

    unless @message.owner.id == current_user.id
      flash[:notice] = 'Hey stop it!'
      redirect_to messages_path
      return
    end

    @message.destroy