app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`email` = 'asdasdasasdasdasdd') LIMIT 1
INSERT INTO `users` (`name`, `updated_at`, `token`, `email`, `created_at`) VALUES('Thomas Hübertz', '2008-11-25 18:40:49', '123', 'hubertz@online.no', '2008-11-25 18:40:49')
UPDATE `users` SET `token` = '4907830e09e5f9a7284d818bbb8d1f72f2fcbba8', `updated_at` = '2008-11-27 08:44:00' WHERE `id` = 1
---
  def create
    @user = User.new(params[:user])


    # generate token

    token = generate_token
    logger.info "Token is "+token

    # check if email is already registered
    existing_user = User.find_by_email(@user.email)
    if existing_user !=nil
      existing_user.token = token
      send_token_email_to_existing_user existing_user
      flash[:notice] = 'Email was successfully sent'
      redirect_to (existing_user)
      return
    else
      @user.token = token
      @user.save